doc/nix-usage-flakes.org
#+title: Nix Setup and Usage with Flakes
#+setupfile: internal/links.org

* Org-mode setup :noexport:

This document is written in a project-agnostic way to be copied to other
projects that use Nix.

** Variables

We set variables in =internal/params.el= and access those settings with the
following macros and source code blocks (using Noweb).

#+name: get
#+begin_src emacs-lisp :var arg="" :eval yes :results silent
(alist-get (intern arg) (car (read-from-string (f-read "internal/params.el"))))
#+end_src

#+macro: get (eval (concat $2 (alist-get (intern $1) (car (read-from-string (f-read "internal/params.el")))) $3))
#+macro: package-attr-short {{{get(package-attr-short,=,=)}}}
#+macro: package-attr-long {{{get(package-attr-long,=,=)}}}
#+macro: package-type {{{get(package-type)}}}
#+macro: package-target-short {{{get(package-target-short,=,=)}}}
#+macro: package-target-long {{{get(package-target-long,=,=)}}}
#+macro: run-attr-short {{{get(run-attr-short,=,=)}}}
#+macro: run-attr-long {{{get(run-attr-long,=,=)}}}
#+macro: run-name {{{get(run-target-short,“,”)}}}
#+macro: run-target-short {{{get(run-target-short,=,=)}}}
#+macro: run-target-long {{{get(run-target-short,=bin/,=)}}}
#+macro: nix-latest {{{get(nix-latest)}}}
#+macro: nixos-latest {{{get(nixos-latest)}}}
#+macro: platforms {{{get(platforms)}}}

** Formatting help

This snippet can be used as a post-processing step to crop down the results from
an evaluation of a source code block.

#+name: crop
#+begin_src emacs-lisp :var text="" :var first-n=5 :var last-n=5 :results silent
(let* ((ls         (split-string text "\n"))
       (first-ls   (-take first-n ls))
       (rest-first (-drop first-n ls))
       (rest-last  (-drop-last (+ 1 last-n) rest-first))
       (last-ls    (-take-last (+ 1 last-n) rest-first)))
  (string-join
   (if rest-last
       (append first-ls '("…") last-ls)
     (append first-ls last-ls))
   "\n"))
#+end_src

** Setup action

Next, we perform some side effects to set up the evaluation of the whole
document.

#+name: cleanup
#+begin_src sh :dir .. :results output silent :noweb yes
rm --force result*
rm --force /tmp/nix-profile*
#+end_src

* About this document

This document explains how to take advantage of software provided by Nix for
people new to [[nix][the Nix package manager]]. This guide uses this project for
examples but focuses on introducing general Nix usage, which also applies to
other projects using Nix.

#+include: "internal/nix-usage-flakes-include.org"

* How this project uses Nix

This project uses Nix to download all necessary dependencies and build
everything from source. In this regard, Nix is helpful as not just a package
manager but also a build tool. Nix helps us get from raw source files to built
executables in a package we can install with Nix.

Within this project, the various files with a ~.nix~ extension are Nix files,
each of which contains an expression written in the [[nix-language-manual][Nix expression language]] used
by the Nix package manager to specify packages. If you get proficient with this
language, you can use these expressions as a starting point to compose your own
packages beyond what's provided in this project.

* Prerequisites

If you're new to Nix consider reading the provided [[file:nix-introduction.org][introduction]].

This project supports {{{platforms}}}.

That may affect your ability to follow along with examples.

Otherwise, see the provided [[file:nix-installation.org][Nix installation and configuration guide]] if you have
not yet set Nix up.

To continue following this usage guide, you will need Nix's experimental flakes
feature. You can enable this globally or use an alias such as the following:

#+begin_src sh :eval no
alias nix-flakes = nix --extra-experimental-features 'nix-command flakes'
#+end_src

* Working with Nix

Though comprehensively covering Nix is beyond the scope of this document, we'll
go over a few commands illustrating some usage of Nix with this project.

** Referencing flake projects

Most of this document illustrates usage of the =nix= command, which provides a
number of subcommands and centralizes Nix usage.

Many of the =nix= subcommands accept references to flake-enabled projects. A
flake is specified with a Nix expression saved in a file named =flake.nix=. This
file should be at the root of a project. We can reference both local and remote
flake projects.

Here are some common forms we can use to reference flake projects:

| Syntax                           | Location                                                       |
|----------------------------------+----------------------------------------------------------------|
| ~.~                              | flake in the current directory                                 |
| ~<path>~                         | flake in some other file path (must have a slash)              |
| ~<registry>~                     | reference to flake from the registry (see =nix registry list=) |
| ~git+<url>~                      | latest flake in the default branch of a Git repository         |
| ~git+<url>?ref=<branch>~         | latest flake in a branch of a Git repository                   |
| ~git+<url>?rev=<commit>~         | flake in a specific commit of a Git repository                 |
| ~github:<owner>/<repo>~          | latest flake in the default branch of a GitHub repository      |
| ~github:<owner>/<repo>/<branch>~ | latest flake in a branch of a GitHub repository                |
| ~github:<owner>/<repo>/<commit>~ | flake in a specific commit of a GitHub repository              |

This table introduces an angle-bracket notation for syntactic forms with
components that change with context. This notation is used throughout this
document.

Referencing local flake projects is easy enough with file paths. But the
URL-like notation for remote flake projects can get verbose.  Furthermore, some
of these references are not fixed. For example, Git branches point to different
commits over time.

To manage flake references, Nix provides a flakes registry. Upon installation
this registry is prepopulated with some global entries:

#+name: nix-registry-list
#+begin_src sh :dir .. :results output :exports both :post crop(text=*this*, first-n=0, last-n=10)
nix registry list
#+end_src

#+RESULTS: nix-registry-list
#+begin_example
…
global flake:nixos-homepage github:NixOS/nixos-homepage
global flake:nixos-search github:NixOS/nixos-search
global flake:nixpkgs github:NixOS/nixpkgs/nixpkgs-unstable
global flake:nur github:nix-community/NUR
global flake:patchelf github:NixOS/patchelf
global flake:poetry2nix github:nix-community/poetry2nix
global flake:pridefetch github:SpyHoodle/pridefetch
global flake:sops-nix github:Mic92/sops-nix
global flake:systems github:nix-systems/default
global flake:templates github:NixOS/templates
#+end_example

For example, rather than referencing the flake on the =nixpkgs-unstable= branch
of the Nixpkgs GitHub repository with ~github:NixOS/nixpkgs/nixpkgs-unstable~,
we can use the simpler identifier ~nixpkgs~.

If we want to point to a different branch but still use an identifier from the
registry, we can do so by extending it with the branch. For example, the flakes
identifier ~nixpkgs~ is the same as ~nixpkgs/nixpkgs-ustable~, but we can also
use {{{get(nixos-latest,~nixpkgs/nixos-,~)}}} to override the branch and point
to the NixOS {{{nixos-latest}}} release branch.

Note that registries have mutable references, but Nix knows how to rebuild the
snapshot referenced for some of these references deterministically. For example,
when referencing a GitHub repository via a registry reference, Nix will take
note of the commit ID of the snapshot retrieved.  Nix typically stores this
information required for reproducibility in a /lock file/ called =flake.lock=
adjacent to =flake.nix=.

