doc/nix-usage-flakes.md
- [About this document](#sec-1)
- [How this project uses Nix](#sec-2)
- [Prerequisites](#sec-3)
- [Working with Nix](#sec-4)
  - [Referencing flake projects](#sec-4-1)
  - [Inspecting flake outputs](#sec-4-2)
  - [Referencing flake outputs](#sec-4-3)
  - [Searching flakes for packages](#sec-4-4)
  - [Building installables](#sec-4-5)
  - [Running commands in a shell](#sec-4-6)
  - [Running installables](#sec-4-7)
  - [`nix run` and `nix shell` with remote flakes](#sec-4-8)
  - [Installing and uninstalling programs](#sec-4-9)
  - [Garbage collection](#sec-4-10)
- [Next steps](#sec-5)


# About this document<a id="sec-1"></a>

This document explains how to take advantage of software provided by Nix for people new to [the Nix package manager](https://nixos.org/nix). This guide uses this project for examples but focuses on introducing general Nix usage, which also applies to other projects using Nix.

This project requires an experimental feature of Nix called *flakes*. To understand more about what flakes are and the consequences of using a still-experimental feature of Nix, please see the provided [introduction to Nix](nix-introduction.md).

# How this project uses Nix<a id="sec-2"></a>

This project uses Nix to download all necessary dependencies and build everything from source. In this regard, Nix is helpful as not just a package manager but also a build tool. Nix helps us get from raw source files to built executables in a package we can install with Nix.

Within this project, the various files with a `.nix` extension are Nix files, each of which contains an expression written in the [Nix expression language](https://nixos.org/manual/nix/stable/language/index.html) used by the Nix package manager to specify packages. If you get proficient with this language, you can use these expressions as a starting point to compose your own packages beyond what's provided in this project.

# Prerequisites<a id="sec-3"></a>

If you're new to Nix consider reading the provided [introduction](nix-introduction.md).

This project supports Linux on x86-64 machines.

That may affect your ability to follow along with examples.

Otherwise, see the provided [Nix installation and configuration guide](nix-installation.md) if you have not yet set Nix up.

To continue following this usage guide, you will need Nix's experimental flakes feature. You can enable this globally or use an alias such as the following:

```sh
alias nix-flakes = nix --extra-experimental-features 'nix-command flakes'
```

# Working with Nix<a id="sec-4"></a>

Though comprehensively covering Nix is beyond the scope of this document, we'll go over a few commands illustrating some usage of Nix with this project.

## Referencing flake projects<a id="sec-4-1"></a>

Most of this document illustrates usage of the `nix` command, which provides a number of subcommands and centralizes Nix usage.

Many of the `nix` subcommands accept references to flake-enabled projects. A flake is specified with a Nix expression saved in a file named `flake.nix`. This file should be at the root of a project. We can reference both local and remote flake projects.

Here are some common forms we can use to reference flake projects:

| Syntax                           | Location                                                       |
|-------------------------------- |-------------------------------------------------------------- |
| `.`                              | flake in the current directory                                 |
| `<path>`                         | flake in some other file path (must have a slash)              |
| `<registry>`                     | reference to flake from the registry (see `nix registry list`) |
| `git+<url>`                      | latest flake in the default branch of a Git repository         |
| `git+<url>?ref=<branch>`         | latest flake in a branch of a Git repository                   |
| `git+<url>?rev=<commit>`         | flake in a specific commit of a Git repository                 |
| `github:<owner>/<repo>`          | latest flake in the default branch of a GitHub repository      |
| `github:<owner>/<repo>/<branch>` | latest flake in a branch of a GitHub repository                |
| `github:<owner>/<repo>/<commit>` | flake in a specific commit of a GitHub repository              |

This table introduces an angle-bracket notation for syntactic forms with components that change with context. This notation is used throughout this document.

Referencing local flake projects is easy enough with file paths. But the URL-like notation for remote flake projects can get verbose. Furthermore, some of these references are not fixed. For example, Git branches point to different commits over time.

To manage flake references, Nix provides a flakes registry. Upon installation this registry is prepopulated with some global entries:

```sh
nix registry list
```

    …
    global flake:nixos-homepage github:NixOS/nixos-homepage
    global flake:nixos-search github:NixOS/nixos-search
    global flake:nixpkgs github:NixOS/nixpkgs/nixpkgs-unstable
    global flake:nur github:nix-community/NUR
    global flake:patchelf github:NixOS/patchelf
    global flake:poetry2nix github:nix-community/poetry2nix
    global flake:pridefetch github:SpyHoodle/pridefetch
    global flake:sops-nix github:Mic92/sops-nix
    global flake:systems github:nix-systems/default
    global flake:templates github:NixOS/templates

For example, rather than referencing the flake on the `nixpkgs-unstable` branch of the Nixpkgs GitHub repository with `github:NixOS/nixpkgs/nixpkgs-unstable`, we can use the simpler identifier `nixpkgs`.

If we want to point to a different branch but still use an identifier from the registry, we can do so by extending it with the branch. For example, the flakes identifier `nixpkgs` is the same as `nixpkgs/nixpkgs-ustable`, but we can also use `nixpkgs/nixos-24.11` to override the branch and point to the NixOS 24.11 release branch.

Note that registries have mutable references, but Nix knows how to rebuild the snapshot referenced for some of these references deterministically. For example, when referencing a GitHub repository via a registry reference, Nix will take note of the commit ID of the snapshot retrieved. Nix typically stores this information required for reproducibility in a *lock file* called `flake.lock` adjacent to `flake.nix`.
