doc/nix-usage-flakes.md

## Inspecting flake outputs<a id="sec-4-2"></a>

A flake can provide a variety of outputs that can be used in different contexts. A few of these outputs include the packages we can build and install.

We can use `nix flake show` to see the outputs provided by any flake, local or remote, by providing a flake reference discussed in the previous section. Here's an example of inspecting the flake of this project locally:

```sh
nix flake show .
```

    git+file:///home/shajra/src/shajra-keyboards
    ├───apps
    │   └───x86_64-linux
    …
    │       ├───flash-ergodoxez: app
    │       ├───flash-model01: app
    │       ├───flash-model100: app
    │       ├───flash-moonlander: app
    │       └───licenses-thirdparty: app
    ├───checks
    │   └───x86_64-linux
    │       └───ci: derivation 'shajra-keyboards-ci'
    ├───legacyPackages
    │   └───x86_64-linux omitted (use '--legacy' to show)
    ├───overlays
    │   └───default: Nixpkgs overlay
    └───packages
        └───x86_64-linux
            ├───default: package 'shajra-keyboards-ci'
            ├───flash-ergodoxez: package 'flash-ergodoxez'
            ├───flash-model01: package 'flash-model01'
            ├───flash-model100: package 'flash-model100'
            ├───flash-moonlander: package 'flash-moonlander'
            └───licenses-thirdparty: package 'shajra-keyboards-licenses'

Flake outputs are organized in a tree of *attributes*. References to paths of attributes are dot-delimited. There is a standard schema for the output attribute tree of a flake. Nix permits outputs outside this schema.

This document focuses on packages provided by the `packages` output attribute. Notice that a flake offers packages for different (but rarely all) system architectures.

For commands like `nix flake show` that expect a flake reference as an argument, `.` is assumed as default if an argument isn't provided. So `nix flake show` is equivalent to `nix flake show .`.

## Referencing flake outputs<a id="sec-4-3"></a>

Many of the `nix` subcommands work with references to flakes outputs. These references are called *installables*. There are many types of installables (hence the general name). In this document, we'll hone in on the following forms:

-   `<flake>` to select a default output from
-   `<flake>#<output reference>` for a reference to packages(s) within a flake.

In this notation, `<flake>` is the same reference to a local or remote flake project discussed in the prior section.

When the installable is just a flake reference, the called `nix` subcommand will generally look for the `packages.<system>.default` attribute path within the flake. So `<flake>` will generally be the same as `<flake>#packages.<system>.default`. One exception to this rule, `nix run` will first look for `<flake>#apps.<system>.default`, and then for `<flake>#packages.<system>.default`.

Installables can also reference an output of a flake (`<output reference>` above) directly in a couple of ways:

| Output reference                     | Example installable                           |
|------------------------------------ |--------------------------------------------- |
| `<output attribute>.<system>.<name>` | `.#packages.x86_64-linux.licenses-thirdparty` |
| `<name>`                             | `.#licenses-thirdparty`                       |

The first way is the most explicit, by providing the full attribute path we can see with `nix flake show`. But this requires specifying the package's system architecture.

With the second form, with the shorter `<name>` package reference, Nix will detect the system we're on and also search some attributes in a precedence order for the provided name:

1.  `apps.<system>.<name>` (`nix run` only)
2.  `packages.<system>.<name>` (all subcommands accepting installables)
3.  `legacyPackages.<system>.<name>` (all subcommands accepting installables)

Which attributes are searched depends on the `nix` subcommand called.

For commands accepting installables as an argument, if none are provided, then `.` is assumed. Nix will attempt to read a `flake.nix` file in the current directory. If not found, Nix will recursively search parent directories to find a `flake.nix` file.

## Searching flakes for packages<a id="sec-4-4"></a>

We can use the `nix search` command to see what package derivations a flake contains. For example, from the root directory of this project, we can execute:

```sh
nix search . ^
```

    * packages.x86_64-linux.default
    
    * packages.x86_64-linux.flash-ergodoxez
      Flash ZSA Technology Lab's Ergodox EZ Keyboard
    
    * packages.x86_64-linux.flash-model01
      Flash Keyboardio's Model 01 Keyboard
    
    * packages.x86_64-linux.flash-model100
    …

We're required to pass regexes as final arguments to prune down the search. Above we've passed `^` to match everything and return all results.

We can also search a remote repository for packages to install. For example, Nixpkgs is a central repository for Nix, providing several thousand packages. We can search the “nixpkgs-unstable” branch of [Nixpkgs' GitHub repository](https://github.com/NixOS/nixpkgs) for packages that match both “gpu|opengl|accel” and “terminal” as follows:

```sh
nix search github:NixOS/nixpkgs/nixpkgs-unstable 'gpu|opengl|accel' terminal
```

As discussed in a previous section, we can use the flakes registry identifier of `nixpkgs` instead of the longer `github:NixOS/nixpkgs/nixpkgs-unstable` to save some typing:

```sh
nix search nixpkgs 'gpu|opengl|accel' terminal
+end_src

#+name: nix-search-remote-concise
#+begin_src sh :dir .. :results output :exports results
nix search nixpkgs 'gpu|opengl|accel' terminal | ansifilter
```

    * legacyPackages.x86_64-linux.alacritty (0.13.1)
      A cross-platform, GPU-accelerated terminal emulator
    
    * legacyPackages.x86_64-linux.darktile (0.0.11)
      A GPU rendered terminal emulator designed for tiling window managers
    
    * legacyPackages.x86_64-linux.kitty (0.32.0)
      A modern, hackable, featureful, OpenGL based terminal emulator
    
    * legacyPackages.x86_64-linux.rio (0.0.34)
      A hardware-accelerated GPU terminal emulator powered by WebGPU
    
    * legacyPackages.x86_64-linux.wezterm (20230712-072601-f4abf8fd)
      GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust

If we're curious about what version of WezTerm is available in NixOS's latest release, we can specialize the installable we're searching as follows:

```sh
nix search nixpkgs/nixos-24.11#wezterm ^
```

    * legacyPackages.x86_64-linux.wezterm (0-unstable-2025-01-03)
      GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust

Here `/nixos-24.11` overrides the default `nixpkgs-unstable` branch of the registry entry, and the `#wezterm` suffix searches not just the flake, but a specific package named `wezterm`, which will either be found or not (there's no need for regexes to filter further).

You may also notice that the Nixpkgs flake outputs packages under the `legacyPackages` attribute instead of the `packages`. The primary difference is that packages are flatly organized under `packages`, while `legacyPackages` can be an arbitrary tree. `legacyPackages` exists specifically for the Nixpkgs project, a central project to the Nix ecosystem that has existed long before flakes. Beyond Nixpkgs, you don't have to think much about `legacyPackages`. Packages from all other flakes should generally be found under `packages`.
