doc/nix-usage-flakes.org
** Building installables

The following result is one returned by our prior execution of ~nix search .~:

#+name: nix-search-specific
#+begin_src sh :dir .. :results output :exports results :noweb yes
nix search . '<<get("package-attr-short")>>' | ansifilter
#+end_src

#+RESULTS: nix-search-specific
: * packages.x86_64-linux.licenses-thirdparty
:   License information for shajra-keyboards project

We can see that a package can be accessed with the {{{package-attr-long}}}
output attribute path of the project's flake. Not shown in the search results
above, this package happens to provide the {{{package-type}}}
{{{package-target-long}}}.

We can build this package with =nix build= from the project root:

#+name: nix-build
#+begin_src sh :dir .. :results output silent :noweb yes
nix build .#<<get("package-attr-short")>>
#+end_src

As discussed in prior sections, the positional arguments to =nix build= are
/installables/. Here, the =.= indicates that our flake should be found from the
current directory. Within this flake, we look for a package with an attribute
name of {{{package-attr-short}}}. We didn't have to use the full attribute path
{{{package-attr-long}}} because =nix build= will automatically look in the
=packages= attribute for the system it detects we're on.

If we omit the attribute path of our installable, Nix tries to build a default
package, which it expects to find under the flake's =packages.<system>.default=.
For example, if we ran just ~nix build .~, Nix would expect to find a
=flake.nix= in the current directory with an output providing a
~packages.<system>.default~ attribute with a package to build.

Furthermore, if we didn't specify an installable at all, Nix would assume we're
trying to build the default package of the flake found from the current
directory. So, the following invocations are all equivalent:
- =nix build=
- =nix build .=
- =nix build .#packages.<system>.default=

All packages built by Nix are stored in =/nix/store=. Nix won't rebuild packages
found there. Once a package is built, its content in =/nix/store= is read-only
(until the package is garbage collected, discussed later).

After a successful call of =nix build=, you'll see one or more symlinks for each
package requested in the current working directory. These symlinks, by default,
have a name prefixed with “result” and point back to the respective build in
=/nix/store=:

#+name: nix-build-link
#+begin_src sh :dir .. :results output :exports both
readlink result*
#+end_src

#+RESULTS: nix-build-link
: /nix/store/35v7dk3i6drqp2q5y30q9xxf1wg1zybp-shajra-keyboards-licenses

Following these symlinks, we can see the files the project provides:

#+name: nix-build-tree
#+begin_src sh :dir .. :results output :exports both :post crop(text=*this*, first-n=10, last-n=0)
tree -l result*
#+end_src

#+RESULTS: nix-build-tree
: result
: └── bin
:     └── shajra-keyboards-licenses
: 
: 2 directories, 1 file

It's common to configure these “result” symlinks as ignored in source control
tools (for instance, for Git within a =.gitignore= file).

=nix build= has a =--no-link= switch in case you want to build packages without
creating “result” symlinks. To get the paths where your packages are located,
you can use =nix path-info= after a successful build:

#+name: nix-build-path
#+begin_src sh :dir .. :results output :exports both :noweb yes
nix path-info .#<<get("package-attr-short")>>
#+end_src

#+results: nix-build-path
: /nix/store/35v7dk3i6drqp2q5y30q9xxf1wg1zybp-shajra-keyboards-licenses

** Running commands in a shell

We can run commands in Nix-curated environments with =nix shell=.  Nix will take
executables found in packages, put them in an environment's =PATH=, and then
execute a user-specified command.

With =nix shell=, you don't have to build the package first with =nix build= or
mess around with “result” symlinks. =nix shell= will build any necessary
packages required.

For example, to get the help message for the {{{run-target-short}}} executable
provided by the package selected by the {{{run-attr-short}}} attribute path
output by this project's flake, we can call the following:

#+name: nix-shell
#+begin_src sh :dir .. :results output :exports both :noweb yes :post crop(text=*this*, first-n=5, last-n=0)
nix shell \
    .#<<get("run-attr-short")>> \
    --command <<get("run-target-short")>> --help
#+end_src

#+RESULTS: nix-shell
: Third Party Licenses for "shajra-keyboards"
: ===========================================
: 
: This project is a build script that uses Nix to download third
: party source codes, modify them as per their respective
: …

Similarly to =nix build=, =nix shell= accepts installables as positional
arguments to select packages to put on the =PATH=.

The command to run within the shell is specified after the =--command= switch.
=nix shell= runs the command in a shell set up with a =PATH= environment
variable that includes all the =bin= directories provided by the selected
packages.

If you only want to enter an interactive shell with the configured =PATH=, you
can drop the =--command= switch and following arguments.

=nix shell= also supports an =--ignore-environment= flag that restricts =PATH=
to only packages selected, rather than extending the =PATH= of the caller's
environment. With =--ignore-environment=, the invocation is more sandboxed.

As with =nix build=, =nix shell= will select default packages for any
installable that is only a flake reference. If no installable is provided to
=nix shell=, the invocation will look for the default package under the
=packages.<system>.default= attribute output by a flake assumed to be in the
current directory. So, the following invocations are all equivalent:
- ~nix shell~
- ~nix shell .~
- ~nix shell .#packages.<system>.default~

