doc/nix-usage-flakes.org
** Running installables

The =nix run= command allows us to run executables from packages with a more
concise syntax than =nix shell= with a =--command= switch.

The main difference from =nix shell= is that =nix run= detects which executable
to run from a package. If we want something other than what can be detected, we
must continue using =nix shell= with =--command=.

As with other =nix= subcommands, =nix run= accepts an installable as an argument
(but only one). If none is provided, then =.= is assumed.

If the provided installable is only a flake reference with no package selected,
then =nix run= searches the following flake output attribute paths, in order,
for something to run:

- =apps.<system>.default=
- =packages.<system>.default=

In flakes, applications are just packages that have been expanded with metadata.
This metadata includes explicitly specifying which executable to use with =nix
run=. Otherwise, for plain packages, =nix run= looks at metadata on the package
to guess the binary to execute within the package.

If only a name is provided, then =nix run= searches in order through the
following output attribute paths:

- =apps.<system>.<name>=
- =packages.<system>.<name>=
- =legacyPackages.<system>.<name>=

And as always, we can specify a full output attribute path explicitly if =nix
run='s search doesn't find what we want to run.

Here's the =nix run= equivalent of the =nix shell= invocation from the previous
section:

#+name: nix-run
#+begin_src sh :dir .. :results output :exports both :noweb yes :post crop(text=*this*, first-n=5, last-n=0)
nix run .#<<get("run-attr-short")>>  -- --help
#+end_src

#+RESULTS: nix-run
: Third Party Licenses for "shajra-keyboards"
: ===========================================
: 
: This project is a build script that uses Nix to download third
: party source codes, modify them as per their respective
: …

We can see some of the metadata of this package with the =--json= switch of =nix
search=:

#+name: nix-search-details
#+begin_src sh :dir .. :results output :exports both :noweb yes :post crop(text=*this*, first-n=5, last-n=0)
nix search --json .#<<get("run-attr-short")>> | jq .
#+end_src

#+RESULTS: nix-search-details
: {
:   "packages.x86_64-linux.licenses-thirdparty": {
:     "description": "License information for shajra-keyboards project",
:     "pname": "shajra-keyboards-licenses",
:     "version": ""
: …

The “pname” field in the JSON above indicates the package's name. In practice,
the package's name may or may not differ from flake output name of the
installable.

=nix run= works because the package selected by the output attribute name
{{{run-attr-short}}} selects a package with a package name {{{run-name}}} that
is the same as the executable provided at {{{run-target-long}}}.

If we want something other than what can be detected, then we have to continue
using =nix shell= with =--command=.

** =nix run= and =nix shell= with remote flakes

In the examples above, we've used selected packages from this project's flake,
like {{{get(run-attr-short,=.#,=)}}}. But one benefit of flakes is that we can
refer to remote flakes just as easily, like =nixpkgs#hello=.  Referencing remote
flakes helps us quickly build environments with =nix shell= or run commands with
=nix run= without committing to install software.

Here's a small example.

#+name: nix-run-remote
#+begin_src sh :results output :exports both :noweb yes
nix run nixpkgs#hello
#+end_src

#+RESULTS: nix-run-remote
: Hello, world!

When using =nix shell=, we can even mix local flake references with remote ones,
all in the same invocation:

#+name: nix-shell-remote
#+begin_src sh :results output :exports both :noweb yes
nix shell --ignore-environment \
    nixpkgs#which \
    .#<<get("run-attr-short")>> \
    --command which <<get("run-target-short")>>
#+end_src

#+RESULTS: nix-shell-remote
: /nix/store/35v7dk3i6drqp2q5y30q9xxf1wg1zybp-shajra-keyboards-licenses/bin/shajra-keyboards-licenses

What we do with local flake references can work just as well with remote flake
references.

** Installing and uninstalling programs

We've seen that we can build programs with =nix build= and execute them using
the “result” symlink (=result/bin/*=). Additionally, we've seen that you can run
programs with =nix shell= and =nix run=. But these additional steps and
switches/arguments can feel extraneous. It would be nice to have the programs on
our =PATH=. This is what =nix profile= is for.

=nix profile= maintains a symlink tree of installed programs called a /profile/.
The default profile is at =~/.nix-profile=. For non-root users, if this doesn't
exist, =nix profile= will create it as a symlink pointing to
=/nix/var/nix/profiles/per-user/$USER/profile=. But you can point =nix profile=
to another profile at any writable location with the =--profile= switch.

This way, you can just put =~/.nix-profile/bin= on your =PATH=, and any programs
installed in your default profile will be available for interactive use or
scripts.

To install the {{{package-target-short}}} {{{package-type}}}, which is provided
by the {{{package-attr-short}}} output of our flake, we'd run the following:

#+begin_src sh :eval no :noweb yes
nix profile install .#<<get("package-attr-short")>>
#+end_src

#+name: nix-profile-install
#+begin_src sh :dir .. :results output silent :exports none :noweb yes
nix profile install --profile /tmp/nix-profile '.#<<get("package-attr-short")>>' 2>&1
#+end_src

We can see this installation by querying what's been installed:

#+begin_src sh :eval no
nix profile list
#+end_src

#+name: nix-profile-list
#+begin_src sh :dir .. :results output :exports results
nix profile list --profile /tmp/nix-profile | ansifilter
#+end_src

#+RESULTS: nix-profile-list
: Index:              0
: Flake attribute:    packages.x86_64-linux.licenses-thirdparty
: Original flake URL: git+file:///home/shajra/src/shajra-keyboards
: Locked flake URL:   git+file:///home/shajra/src/shajra-keyboards
: Store paths:        /nix/store/35v7dk3i6drqp2q5y30q9xxf1wg1zybp-shajra-keyboards-licenses

If we want to uninstall a program from our profile, we do so by the index from
this list:

#+name: nix-profile-remove
#+begin_src sh :eval no :noweb yes
nix profile remove 0
#+end_src

We can also provide a regex matching the full attribute path of the flake:

#+begin_src sh :eval no :noweb yes
nix profile remove '.*<<get("package-attr-short")>>'
#+end_src

#+name: nix-profile-remove
#+begin_src sh :dir .. :results silent :exports none :noweb yes
nix profile remove --profile /tmp/nix-profile '.*<<get("package-attr-short")>>'
#+end_src

Also, if you look at the symlink-resolved location for your profile, you'll see
that Nix retains the symlink trees of previous generations of your profile. You
can even roll back to an earlier profile with the =nix profile rollback=
subcommand. You can delete old generations of your profile with the =nix profile
wipe-history= subcommand.

