doc/nix-usage-flakes.md

## Running installables<a id="sec-4-7"></a>

The `nix run` command allows us to run executables from packages with a more concise syntax than `nix shell` with a `--command` switch.

The main difference from `nix shell` is that `nix run` detects which executable to run from a package. If we want something other than what can be detected, we must continue using `nix shell` with `--command`.

As with other `nix` subcommands, `nix run` accepts an installable as an argument (but only one). If none is provided, then `.` is assumed.

If the provided installable is only a flake reference with no package selected, then `nix run` searches the following flake output attribute paths, in order, for something to run:

-   `apps.<system>.default`
-   `packages.<system>.default`

In flakes, applications are just packages that have been expanded with metadata. This metadata includes explicitly specifying which executable to use with `nix run`. Otherwise, for plain packages, `nix run` looks at metadata on the package to guess the binary to execute within the package.

If only a name is provided, then `nix run` searches in order through the following output attribute paths:

-   `apps.<system>.<name>`
-   `packages.<system>.<name>`
-   `legacyPackages.<system>.<name>`

And as always, we can specify a full output attribute path explicitly if `nix run`'s search doesn't find what we want to run.

Here's the `nix run` equivalent of the `nix shell` invocation from the previous section:

```sh
nix run .#licenses-thirdparty  -- --help
```

    Third Party Licenses for "shajra-keyboards"
    ===========================================
    
    This project is a build script that uses Nix to download third
    party source codes, modify them as per their respective
    …

We can see some of the metadata of this package with the `--json` switch of `nix search`:

```sh
nix search --json .#licenses-thirdparty ^ | jq .
```

    {
      "packages.x86_64-linux.licenses-thirdparty": {
        "description": "License information for shajra-keyboards project",
        "pname": "shajra-keyboards-licenses",
        "version": ""
    …

The “pname” field in the JSON above indicates the package's name. In practice, the package's name may or may not differ from flake output name of the installable.

`nix run` works because the package selected by the output attribute name `licenses-thirdparty` selects a package with a package name “shajra-keyboards-licenses” that is the same as the executable provided at `bin/shajra-keyboards-licenses`.

If we want something other than what can be detected, then we have to continue using `nix shell` with `--command`.

## `nix run` and `nix shell` with remote flakes<a id="sec-4-8"></a>

In the examples above, we've used selected packages from this project's flake, like `.#licenses-thirdparty`. But one benefit of flakes is that we can refer to remote flakes just as easily, like `nixpkgs#hello`. Referencing remote flakes helps us quickly build environments with `nix shell` or run commands with `nix run` without committing to install software.

Here's a small example.

```sh
nix run nixpkgs#hello
```

    Hello, world!

When using `nix shell`, we can even mix local flake references with remote ones, all in the same invocation:

```sh
nix shell --ignore-environment \
    nixpkgs#which \
    .#licenses-thirdparty \
    --command which shajra-keyboards-licenses
```

    /nix/store/vrn2xwkh5xy3j7pjigh482s0np218k77-shajra-keyboards-licenses/bin/shajra-keyboards-licenses

What we do with local flake references can work just as well with remote flake references.

## Installing and uninstalling programs<a id="sec-4-9"></a>

We've seen that we can build programs with `nix build` and execute them using the “result” symlink (`result/bin/*`). Additionally, we've seen that you can run programs with `nix shell` and `nix run`. But these additional steps and switches/arguments can feel extraneous. It would be nice to have the programs on our `PATH`. This is what `nix profile` is for.

`nix profile` maintains a symlink tree of installed programs called a *profile*. The default profile is at `~/.nix-profile`. For non-root users, if this doesn't exist, `nix profile` will create it as a symlink pointing to `/nix/var/nix/profiles/per-user/$USER/profile`. But you can point `nix profile` to another profile at any writable location with the `--profile` switch.

This way, you can just put `~/.nix-profile/bin` on your `PATH`, and any programs installed in your default profile will be available for interactive use or scripts.

To install the `shajra-keyboards-licenses` executable, which is provided by the `licenses-thirdparty` output of our flake, we'd run the following:

```sh
nix profile install .#licenses-thirdparty
```

We can see this installation by querying what's been installed:

```sh
nix profile list
```

    Name:               licenses-thirdparty
    Flake attribute:    packages.x86_64-linux.licenses-thirdparty
    Original flake URL: git+file:///home/shajra/src/shajra-keyboards
    Locked flake URL:   git+file:///home/shajra/src/shajra-keyboards
    Store paths:        /nix/store/vrn2xwkh5xy3j7pjigh482s0np218k77-shajra-keyboards-licenses

If we want to uninstall a program from our profile, we can reference it by name:

```sh
nix profile remove licenses-thirdparty
```

Also, if you look at the symlink-resolved location for your profile, you'll see that Nix retains the symlink trees of previous generations of your profile. You can even roll back to an earlier profile with the `nix profile rollback` subcommand. You can delete old generations of your profile with the `nix profile wipe-history` subcommand.
