doc/nix-usage-flakes.md

## Garbage collection<a id="sec-4-10"></a>

Every time you build a new version of your code, it's stored in `/nix/store`. You can call `nix store gc` to purge unneeded packages. Programs that should not be removed by `nix store gc` can be found by starting with symlinks stored as *garbage collection (GC) roots* under three locations:

-   `/nix/var/nix/gcroots`
-   `/nix/var/nix/profiles`
-   `/nix/var/nix/manifests`.

For each package, Nix is aware of all files that reference back to other packages in `/nix/store`, whether in text files or binaries. This dependency tracking helps Nix ensure that dependencies of packages reachable from GC roots won't be deleted by garbage collection.

Each “result” symlink created by a `nix build` invocation has a symlink in `/nix/var/nix/gcroots/auto` pointing back to it. So we've got symlinks in `/nix/var/nix/gcroots/auto` pointing to “result” symlinks in our projects, which then reference the actual built project in `/nix/store`. These chains of symlinks prevent packages built by `nix build` from being garbage collected.

If you want a package you've built with `nix build` to be garbage collected, delete the “result” symlink created before calling `nix store gc`. Breaking symlink chains under `/nix/var/nix/gcroots` removes protection from garbage collection. `nix store gc` will clean up broken symlinks when it runs.

Everything under `/nix/var/nix/profiles` is also considered a GC root. This is why users, by convention, use this location to store their Nix profiles with `nix profile`.

Also, note if you delete a “result\*” link and call `nix store gc`, though some garbage may be reclaimed, you may find that an old profile is keeping the program alive. Use the `nix profile wipe-history` command to delete old profiles before calling `nix store gc`.

It's also good to know that `nix store gc` won't delete packages referenced by any running processes. In the case of `nix run` no garbage collection root symlink is created under `/nix/var/nix/gcroots`, but while `nix run` is running `nix store gc` won't delete packages needed by the running command. However, once the `nix run` call exits, any packages pulled from a substituter or built locally are candidates for deletion by `nix store gc`. If you called `nix run` again after garbage collecting, those packages may be pulled or built again.

# Next steps<a id="sec-5"></a>

This document has covered a fraction of Nix usage, hopefully enough to introduce Nix in the context of [this project](../README.md).

An obvious place to start learning more about Nix is [the official documentation](https://nixos.org/learn.html).

Bundled with this project is [a small tutorial on the Nix language](nix-language.md).

All the commands we've covered have more switches and options. See the respective man pages for more.

We didn't cover much of [Nixpkgs](https://github.com/NixOS/nixpkgs), the gigantic repository of community-curated Nix expressions.

The Nix ecosystem is vast. This project and documentation illustrate only a small sample of what Nix can do.
